/*
 *  src/common/s21_string.c
 *  (c) T. Enikeev
 *  enikeev.tg@gmail.com
 *  zeftyrst@student.21-school.ru
 */

#include "s21_string.h"

/*==============================================================================
                        Функция определения длины строки
==============================================================================*/
// unsigned int s21_strlen(const char* str) {
int s21_strlen(const char* str) {
  int count = 0;
  while (*str++) count++;
  return count;
}

/*==============================================================================
                          Функция сравнения двух строк
==============================================================================*/
int s21_strcmp(const char* str1, const char* str2) {
  for (; *str1 && *str1 == *str2; str1++, str2++) {
  }
  return *str1 - *str2;
}

/*==============================================================================
            Функция копирования содержимого из одной строки в другую
==============================================================================*/
void s21_strcpy(char* child_str, char* parent_str) {
  while ((*child_str++ = *parent_str++)) {
  }
  *child_str = '\0';
}

/*==============================================================================
                      Функция поиска символа в строке
==============================================================================*/
char* s21_strchr(char* str, char symb) {
  for (; symb != *str && *str != '\0'; str++) {
  }
  if (*str == '\0') str = S21_NULL;
  return str;
}
