#include "e_string.h"

//#include <stddef.h>  // typedef __SIZE_TYPE__ size_t;

/*===================================================================================
                          Функция определения длины строки
===================================================================================*/
int e_strlen(const char* str) {
  int count = 0;
  while (str[count] != '\0') count++;
  return count;
}

/*===================================================================================
                            Функция сравнения двух строк
===================================================================================*/
int e_strcmp(const char* str1, const char* str2) {
  int count = 0;
  while (str1[count] == str2[count] && str1[count] != '\0') count++;
  return str1[count] - str2[count];
}
